Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes
The WeldMarkAttributes class is the attributes class for the weld mark attributes.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._SeamAbove


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._SeamBelow


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._Font


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._CustomPresentation


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._LineColor


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes._LineType


Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.ShowWeldNumber
The visibility of the weld number.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.SeamAbove
The visibility of the seam above parameters.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.SeamBelow
The visibility of the seam below parameters.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.ShowReferenceText
Gets or sets visibility of the weld mark reference text.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.ShowEdgeAround
Gets or sets visibility of the weld mark edge/around property.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.ShowWorkshopSite
Gets or sets visibility of the weld mark workshop/site property.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.Font
The weld mark font settings.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.TransparentBackground
Controls the text background transparency (transparent/opaque).

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.#ctor(System.Boolean)
Creates a new default weld mark attributes instance that might load attributes.
SkipLoading value does make any difference.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.#ctor
Creates a new default weld mark attributes instance that loads standard attributes.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.#ctor(System.String)
Creates a new weld mark attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.